[
    {
        "title": "freeCodeCamp - Back End Development and APIs",
        "date": "August 17, 2025",
        "description": {
            "summary": "Completed a curriculum focused on backend development with Node.js, Express, and MongoDB, emphasizing REST-style APIs and microservices. Gained experience with server-side logic, middleware, and data persistence using Mongoose. Applied skills by building and deploying multiple backend projects.",
            "points": [
                "<a href='https://www.freecodecamp.org/certification/brainkoko/back-end-development-and-apis'><u>Link</u></a>",
                "Learned Node.js fundamentals, npm workflows, and Express routing/middleware",
                "Designed and documented RESTful APIs and JSON microservices",
                "Implemented CRUD operations and schema modeling with MongoDB/Mongoose",
                "Completed five backend projects: Timestamp Microservice, Request Header Parser, URL Shortener, Exercise Tracker, and File Metadata Microservice"
            ]
        }
    },
    {
        "title": "Kaggle - Intro to Machine Learning",
        "date": "July 26, 2025",
        "description": {
            "summary": "Gained hands-on experience with supervised learning, model evaluation, feature engineering, and scikit-learn tools to build and improve predictive models.",
            "points": [
                "<a href='https://www.kaggle.com/learn/certification/brainkoko/intro-to-machine-learning'><u>Link</u></a>"
            ]
        }
    },
    {
        "title": "Kaggle - Data Visualization",
        "date": "July 15, 2025",
        "description": {
            "summary": "Gained hands-on experience visualizing data with Seaborn, including bar plots, histograms, box plots, heatmaps, and scatter plots; applied best practices for exploring distributions, relationships, and categorical data in Python.",
            "points": [
                "<a href='https://www.kaggle.com/learn/certification/brainkoko/data-visualization'><u>Link</u></a>"
            ]
        }
    },
    {
        "title": "Kaggle - Pandas",
        "date": "July 13, 2025",
        "description": {
            "summary": "Demonstrated proficiency in data analysis using the pandas library in Python, including DataFrame manipulation, data cleaning, aggregation, merging, and time series analysis.",
            "points": [
                "<a href='https://www.kaggle.com/learn/certification/brainkoko/pandas'><u>Link</u></a>"
            ]
        }
    },
    {
        "title": "MongoDB - M001 MongoDB Basics",
        "date": "June 20, 2022",
        "description": {
            "summary": "Learned core concepts of NoSQL databases and MongoDB's document-oriented model.",
            "points": [
                "<a href='https://university.mongodb.com/course_completion/648910000000000000000000'><u>Link</u></a>",
                "Performed CRUD operations (Create, Read, Update, Delete) using the MongoDB Shell and Compass",
                "Learned schema design principles for flexible, scalable data models",
                "Queried data using advanced filter conditions, projections, and sorting",
                "Utilized indexes to improve performance and analyzed explain plans",
                "Connected to MongoDB Atlas clusters and configured cloud-based deployments",
                "Explored aggregation pipelines for data transformation and computation"
            ]
        }
    }
]